#include "system.h"
/*
*注意：使用keil需要设置为GB2312
*==============================系统初始化源文件=======================
*-------------------------------------------------------------------
*文件修改历史
*<时间>    | <版本>  | <作者>  | <功能>  
*2023.2.24 | V1.0.2   | 小夏    | 系统初始化、delay_ms延时
*-------------------------------------------------------------------
*如需要教学请到CSDN上面搜索"单片有机机"的STC32G专栏
*/

/*-------------------------------------------------------------
*功能：STC32G引脚初始化及其其他配置
*作者：小夏
*修改时间：2023.2.24
*参考：<STC32G技术手册>
*-------------------------------------------------------------*/
void GPIO_Init(void){
	
	
	WTST = 0x00;  //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
  EAXFR = 1; //扩展寄存器(XFR)访问使能
  CKCON = 0x00; //提高访问XRAM速度
	
	P0M1 = 0x00;   P0M0 = 0x00;   //设置为高阻输入
	P1M1 = 0x00;   P1M0 = 0x00;   //设置为高阻输入
	P2M1 = 0x00;   P2M0 = 0x00;   //设置为准双向口
	P3M1 = 0x00;   P3M0 = 0x00;   //设置为准双向口
	P4M1 = 0x00;   P4M0 = 0x00;   //设置为准双向口
	P5M1 = 0x00;   P5M0 = 0x00;   //设置P5.4为高阻输入
	P6M1 = 0x00;   P6M0 = 0x00;   //设置为准双向口
	P7M1 = 0x00;   P7M0 = 0x00;   //设置为准双向口
		
}
/*-------------------------------------------------------------
*功能：delay_ms延时配置
*作者：小夏
*修改时间：2023.2.24
*参考：<STC32G技术手册>
*-------------------------------------------------------------*/
void Delay_ms(u32 x){ //误差+-0.12ms 够用
	unsigned int i;
	do{
		i = Sysclk / 6010; //3980.09950 -5556  -
		while(--i);
	}while(--x);		
}